Repository: dmedri/R-italian-lang
Catalog: packages/rpart/po/*.po
Languages: it

source: Invalid time point
it: Punto temporale non valido

source: Invalid event count
it: Conteggio eventi non valido

source: Invalid error rule
it: Regola di errore non valida

source: Invalid value for 'method'
it: Valore non valido per 'method'

source: unknown error
it: errore sconosciuto

source: 'yback' not found
it: ‘yback’ non trovato

source: 'wback' not found
it: ‘wback’ non trovato

source: 'xback' not found
it: ‘xback’ non trovato

source: 'nback' not found
it: ‘nback’ non trovato

source: return value not a vector
it: il valore restituito non è un vettore

source: returned value is the wrong length
it: il valore restituito è di lunghezza errata

source: the expression expr1 did not return a vector!
it: l'espressione expr1 non ha restituito un vettore!
