Repository: dmedri/R-italian-lang
Catalog: packages/src/library/rpart/po/*/LC_MESSAGES/R-*.po
Languages: it

source: 'cptable' does not contain cross-validation results
it: 'cptable' non contiene i risultati della cross-validation

source: 'parms' component not matched: %s
it: il componente 'parms' non corrisponde: %s

source: 'x' must be a numeric vector
it: 'x' dev'essere un vettore numerico

source: 'x' must be an "rpart" object
it: 'x' dev'essere un oggetto "rpart"

source: Argument %s not matched
it: L'argomento %s non corrisponde

source: Cost vector is the wrong length
it: Il vettore di costo è di lunghezza errata

source: Cost vector must be positive
it: Il vettore di costo dev'essere positivo

source: Initialization routine is missing the 'summary' function
it: Nella routine di inizializzazione manca la funzione 'summary'

source: Invalid error method for Poisson
it: Metodo di errore non valido per Poisson

source: Invalid fit object
it: Oggetto adattamento non valido

source: Invalid method
it: Metodo non valido

source: Invalid prediction for "rpart" object
it: Previsione non valida per l'oggetto "rpart"

source: Invalid return from categorical 'split' function
it: Restituzione non valida dalla funzione di 'split' categorica

source: Invalid shrinkage value
it: Valore di restringimento non valido

source: Invalid splitting rule
it: Regola di suddivisione non valida

source: Invalid type of residual
it: Tipo di residuo non valido

source: Loss matrix cannot have negative elements
it: La matrice di perdita non può avere elementi negativi

source: Loss matrix has a row of zeros
it: La matrice di perdita ha una riga di zeri

source: Loss matrix must have zero on diagonals
it: La matrice di perdita deve avere degli zero sulle diagonali

source: Maximum depth is 30
it: La profondità massima è 30

source: Maximum depth must be at least 1
it: La profondità massima dev'essere almeno 1

source: No deaths in data set
it: Nessun decesso nel dataset

source: No offset allowed in classification models
it: Non è ammesso alcun offset nei modelli di classificazione

source: Nodes %s are not in this tree
it: I nodi %s non si trovano in questo albero

source: Not a legitimate "rpart" object
it: Non è un oggetto "rpart" legittimo

source: Not an "rpart" object
it: Non è un oggetto "rpart"

source: Not legitimate "rpart" tree and endpoint not a 2 level-factor
it: Non è un albero "rpart" legittimo e l'endpoint non ha un fattore a 2 livelli

source: Number of events must be >= 0
it: Il numero di eventi dev'essere >= 0

source: Observation time must be > 0
it: Il tempo di osservazione dev'essere > 0

source: Parameter argument must be a list
it: L'argomento parametro dev'essere una lista

source: Plot not useful for classification or poisson trees
it: Plot non utile per la classificazione o gli alberi di Poisson

source: Priors must be >= 0
it: I priori devono essere >= 0

source: Priors must sum to 1
it: I priori devono sommare 1

source: Response must be a 'survival' object - use the 'Surv()' function
it: La risposta dev'essere un oggetto 'survival' - si utilizzi la funzione 'Surv()'

source: The parms list must have names
it: La lista dei parametri deve avere nomi

source: The value of 'maxcompete' supplied is < 0; the value 0 was used instead
it: Il valore di 'maxcompete' passato è < 0; al suo posto è stato utilizzato il valore 0

source: The value of 'surrogatestyle' supplied was out of range, the default value of 0 is used instead.
it: Il valore di 'surrogatestyle' passato era fuori intervallo, al suo posto è stato utilizzato il valore predefinito 0.

source: The value of 'usesurrogate' supplied was out of range, the default value of 2 is used instead.
it: Il valore di 'useurrogate' passato era fuori intervallo, al suo posto è stato utilizzato il valore predefinito 2.

source: The value of 'xval' supplied is < 0; the value 0 was used instead
it: Il valore di 'xval' passato è < 0; al suo posto è stato utilizzato il valore 0

source: Tree has variables not found in new data
it: L'albero ha variabili non trovate nei nuovi dati

source: Trees cannot handle interaction terms
it: Gli alberi non possono gestire i termini di interazione

source: User 'eval' function returned invalid deviance
it: La funzione 'eval' dell'utente ha restituito una deviazione non valida

source: User 'eval' function returned invalid label
it: La funzione 'eval' dell'utente ha restituito un'etichetta non valida

source: User 'split' function returned invalid direction
it: La funzione 'split' dell'utente ha restituito una direzione non valida

source: User 'split' function returned invalid goodness
it: La funzione 'split' dell'utente ha restituito un valore goodness non valido

source: User written method does not contain a 'split' function
it: Il metodo scritto dall'utente non contiene una funzione di 'split'

source: User written method does not contain an 'eval' function
it: Il metodo scritto dall'utente non contiene una funzione di 'eval'

source: User written method does not contain an 'init' function
it: Il metodo scritto dall'utente non contiene una funzione di 'init'

source: User written methods must have 3 functions
it: I metodi scritti dall'utente devono avere 3 funzioni

source: Wrong length for 'xval'
it: Lunghezza errata per 'xval'

source: Wrong length for loss matrix
it: Lunghezza errata per la matrice di perdita

source: Wrong length for priors
it: Lunghezza errata per i priori

source: You must input a named list for parms
it: E' necessaria una lista nominata di parametri

source: a 'formula' argument is required
it: un argomento 'formula' è richiesto

source: argument 'label' is no longer used
it: l'argomento 'label' non è più utilizzato

source: fit is not a tree, just a root
it: l'adattamento non è un albero, giusto una radice

source: may not be applicable for this method
it: potrebbe non essere applicabile per questo metodo

source: negative weights not allowed
it: pesi negativi non ammessi

source: no information available on parameters from previous call to plot()
it: nessuna informazione disponibile sui parametri dalla precedente chiamata a plot()

source: response must be a 2 column matrix or a vector
it: la risposta dev'essere una matrice a 2 colonne o un vettore

source: supplied nodes %s are leaves
it: i nodi passati %s sono foglie

source: supplied nodes %s are not in this tree
it: i nodi passati %s non sono in questo albero

source: type 'class' is only appropriate for classification
it: il tipo 'class' è appropriato unicamente per la classificazione
