Repository: dmedri/R-italian-lang
Catalog: packages/nlme/po/*.po
Languages: it

source: All parameters must be less than 1 in absolute value
it: Tutti i parametri devono essere inferiori a 1 in valore assoluto

source: Coefficient matrix not invertible
it: Matrice dei coefficienti non invertibile

source: Unknown spatial correlation class
it: Classe di correlazione spaziale sconosciuta

source: First observation on an individual must have a dose
it: La prima osservazione su un individuo deve avere un dosaggio

source: Singularity in backsolve at level %ld, block %ld
it: Singolarità in backsolve a livello %ld, blocco %ld

source: Too many parameters for finite-difference Hessian; npar = %d, nTot = %g.
it: Troppi parametri per una differenza-finita Hessian; npar = %d, nTot = %g.

source: Overfitted model!
it: Modello sovra-adattato!

source: analytic gradient is not available with matrix logarithm
it: il gradiente analitico non è disponibile con il logaritmo della matrice

source: analytic gradient is not available with compound symmetry
it: il gradiente analitico non è disponibile con simmetria composta

source: Unable to form eigenvalue-eigenvector decomposition [RS(.) ierr = %d]
it: Non è possibile formare una decomposizione eigenvalue-eigenvector [RS(.) ierr = %d]

source: Unable to form Cholesky decomposition: the leading minor of order %d is not pos.def.
it: Non è possibile formare la decomposizione di Cholesky: il minore principale dell'ordine %d non è pos.def.

source: Haven't written the compound symmetry case for this yet
it: Non ho ancora scritto il caso della simmetria composta per questo
