Repository: dmedri/R-italian-lang
Catalog: packages/nlme/po/R-*.po
Languages: it

source: not implemented for "nlme" objects
it: non implementato per oggetti "nlme"

source: not implemented for multiple levels of nesting
it: non implementato per annidamenti con più livelli

source: individual %s was not used in the fit
it: il singolo %s non è stato utilizzato nell'adattamento

source: not implemented for uncorrelated errors
it: non implementato per errori non correlati

source: not implemented for correlation structures without a grouping factor
it: non implementato per strutture di correlazione senza un fattore di raggruppamento

source: do not know how to calculate correlation matrix of %s object
it: non è possibile calcolare la matrice di correlazione dell'oggetto %s

source: "corStruct" object must have a "fixed" attribute
it: l'oggetto "corStruct" deve avere un attributo "fixed"

source: do not know how to obtain parameters of %s object
it: non è possibile ottenere i parametri dell'oggetto %s

source: cannot change the length of the parameter of a "corStruct" object
it: non è possibile cambiare la lunghezza di un oggetto "corStruct"

source: 'sumLenSq := sum(table(groups)^2)' = %g is too large. Too large or no groups in your correlation structure?
it: 'sumLenSq := sum(table(groups)^2)' = %g è troppo grande. Troppo grande o nessun gruppo nella tua struttura di correlazione?

source: cannot change 'form'
it: non è possibile cambiare 'form'

source: need data to calculate covariate of "corStruct" object
it: sono richiesti i dati per calcolare la covariata dell'oggetto "corStruct"

source: cannot change the length of the parameter of a "corSymm" object
it: non è possibile cambiare la lunghezza di un oggetto "corSymm"

source: covariate must have unique values within groups for "corSymm" objects
it: la covariata deve avere valori univoci nei gruppi per oggetti "corSymm"

source: unique values of the covariate for "corSymm" objects must be a sequence of consecutive integers
it: i valori univoci della covariata per oggetti "corSymm" devono essere una sequenza di interi consecutivi

source: initial value for "corSymm" parameters of wrong dimension
it: valore iniziale per i parametri "corSymm" con dimensione errata

source: initial values for "corSymm" must be between -1 and 1
it: i valori iniziali per "corSymm" dev'essere tra -1 e 1

source: initial values for "corSymm" do not define a positive-definite correlation structure
it: i valori iniziali per "corSymm" non definiscono una struttura di correlazione positivamente definita

source: cannot change the length of the parameter of a "corNatural" object
it: non è possibile cambiare la lunghezza di un oggetto "corNatural"

source: covariate must have unique values within groups for "corNatural" objects
it: la covariata deve avere valori univoci nei gruppi per oggetti "corNatural"

source: unique values of the covariate for "corNatural" objects must be a sequence of consecutive integers
it: i valori univoci della covariata per oggetti "corNatural" devono essere una sequenza di interi consecutivi

source: initial value for "corNatural" parameters of wrong dimension
it: valore iniziale per i parametri "corNatural" con dimensione errata

source: initial values for "corNatural" must be between -1 and 1
it: i valori iniziali per "corNatural" dev'essere tra -1 e 1

source: initial values for "corNatural" do not define a positive-definite correlation structure
it: i valori iniziali per "corNatural" non definiscono una struttura di correlazione positivamente definita

source: parameter in AR(1) structure must be between -1 and 1
it: il parametro nella struttura AR(1) dev'essere tra -1 e 1

source: 'sumLenSq' = %g is too large (larger than maximal integer)
it: 'sumLenSq' = %g è troppo grande (più grande del massimo intero)

source: cannot change the length of the parameter of a "corAR1" object
it: non è possibile cambiare la lunghezza del parametro di un oggetto "corAR1"

source: covariate must have unique values within groups for "corAR1" objects
it: la covariata deve avere valori univoci nei gruppi per oggetti "corAR1"

source: parameter in CAR(1) structure must be between 0 and 1
it: il parametro nella struttura CAR(1) dev'essere tra 0 e 1

source: cannot change the length of the parameter of a "corCAR1" object
it: non è possibile cambiare la lunghezza di un oggetto "corCAR1"

source: covariate must have unique values within groups for "corCAR1" objects
it: la covariata deve avere valori univoci nei gruppi per oggetti "corCAR1"

source: autoregressive order must be a non-negative integer
it: l'ordine autoregressivo dev'essere un intero non-negativo

source: moving average order must be a non-negative integer
it: l'ordine della media mobile dev'essere un intero non-negativo

source: initial value for parameter of wrong length
it: valore iniziale per il parametro con lunghezza errata

source: parameters in ARMA structure must be < 1 in absolute value
it: i parametri nella struttura ARMA devono essere < 1 in valore assoluto

source: 'object' has not been Initialize()d
it: 'object' non è stato inizializzato

source: cannot change the length of the parameter of a "corARMA" object
it: non è possibile cambiare la lunghezza di un oggetto "corARMA"

source: covariate must have unique values within groups for "corARMA" objects
it: la covariata deve avere valori univoci nei gruppi per oggetti "corARMA"

source: parameter in "corCompSymm" structure must be < 1 in absolute value
it: il parametro nella struttura "corCompSymm" dev'essere < 1 in valore assoluto

source: cannot change the length of the parameter of a "corCompSymm" object
it: non è possibile cambiare la lunghezza di un oggetto "corCompSymm"

source: initial value in "corCompSymm" must be greater than %s
it: il valore iniziale in "corCompSymm" dev'essere più grande di %s

source: cannot change the length of the parameter after initialization
it: non è possibile cambiare la lunghezza del parametro dopo l'inizializzazione

source: need data to calculate covariate
it: richiesti dati per calcolare le covariate

source: cannot have zero distances in "corSpatial"
it: non si possono avere distanze zero in "corSpatial"

source: 'range' must be > 0 in "corSpatial" initial value
it: 'range' dev'essere > 0 nel valore iniziale "corSpatial"

source: initial value for "corSpatial" parameters of wrong dimension
it: valore iniziale per i parametri "corSpatial" con dimensione errata

source: initial value of nugget ratio must be between 0 and 1
it: il valore iniziale del rapporto nugget dev'essere tra 0 e 1

source: 'range' must be > 0 in "corLin" initial value
it: 'range' dev'essere > 0 nel valore iniziale "corLin"

source: initial value for 'range' less than minimum distance. Setting it to 1.1 * min(distance)
it: il valore iniziale per 'range' è inferiore alla distanza minima. Lo si imposta a 1.1*min(distance)

source: initial value for "corLin" parameters of wrong dimension
it: valore iniziale per i parametri "corLin" con dimensione errata

source: range must be > 0 in "corSpher" initial value
it: l'intervallo dev'essere > 0 nel valore iniziale "corSpher"

source: initial value for "corSpher" parameters of wrong dimension
it: valore iniziale per i parametri "corSpher" con dimensione errata

source: model must be a formula of the form "resp ~ pred"
it: il modello dev'essere una formula nella forma "resp ~ pred"

source: no coefficients to fit
it: nessun coefficiente per l'adattamento

source: maximum number of iterations reached without convergence
it: raggiunto il numero massimo di iterazioni senza convergenza

source: computed "gls" fit is singular, rank %s
it: adattamento "gls" singolare, rango %s

source: object must inherit from class "gls"
it: l'oggetto deve ereditare dalla classe "gls"

source: 'Terms' must be between 1 and %d
it: 'Terms' dev'essere tra 1 e %d

source: terms can only be integers or characters
it: i termini possono essere solo di tipo integer o character

source: data in %s call must evaluate to a data frame
it: 'data' nella chiamata %s deve valutare un data frame

source: %s without "primary" can only be used with fits of "groupedData" objects
it: %s senza "primary" può essere utilizzata solamente con adattamenti ad oggetti "groupedData"

source: only one level allowed for predictions
it: ammesso solo un livello per le previsioni

source: %s and %s must have the same group levels
it: %s e %s deve avere i medesimi livelli di gruppo

source: wrong group levels
it: gruppo livelli sbagliato

source: cannot get confidence intervals on var-cov components: %s
it: non si possono avere intervalli di confidenza su componenti var-cor: %s

source: need an object with call component
it: necessario un oggetto con una componente call

source: 'nint' is not consistent with 'breaks'
it: 'nint' non è coerente con 'breaks'

source: Within-group std. dev. must be a positive numeric value
it: La std.dev. interna al gruppo dev'essere un valore numerico positivo

source: 'object' must be a formula
it: 'object' dev'essere una formula

source: object formula must be of the form "resp ~ pred"
it: l'oggetto formula dev'essere nella forma "resp ~ pred"

source: 'data' must be given explicitly to use 'nls' to get initial estimates
it: 'data' dev'essere indicato esplicitamente affinché 'nls' possa ottenere stime iniziali

source: no initial values for model parameters
it: nessun valore iniziale per i parametri del modello

source: starting estimates must have names when 'params' is missing
it: le stime iniziali devono avere nomi quando 'params' è assente

source: 'params' must be a formula or list of formulae
it: 'params' dev'essere una formula o una lista di formule

source: formulae in 'params' must be of the form "parameter ~ expr"
it: la formula in 'params' dev'essere nella forma "parametro ~ espressione"

source: starting values for parameters are not of the correct length
it: valori iniziali nei parametri con lunghezza errata

source: cannot calculate REML log-likelihood for "gnls" objects
it: non è possibile calcolare la log-verosimiglianza REML per gli oggetti "gnls"

source: first argument to 'groupedData' must be a two-sided formula
it: il primo argomento di 'groupedData' dev'essere una formula a due lati

source: right-hand side of first argument must be a conditional expression
it: il lato destro del primo argomento dev'essere un'espressione condizionale

source: first argument to 'nfGroupedData' must be a two-sided formula
it: il primo argomento di 'nfGroupedData' dev'essere una formula a due lati

source: only one level of grouping allowed
it: ammesso solo un livello di raggruppamento

source: second argument to 'groupedData' must inherit from data.frame
it: il secondo argomento di 'groupedData' deve ereditare da data.frame

source: first argument to 'nmGroupedData' must be a two-sided formula
it: il primo argomento di 'nmGroupedData' dev'essere una formula a due lati

source: single group not supported -- use groupedData()
it: gruppo singolo non supportato -- si utilizzi groupedData()

source: 'subset' ignored with single grouping factor
it: 'subset' è ignorato con un singolo fattore di raggruppamento

source: 'subset' must be a list
it: 'subset' dev'essere una lista

source: undefined group declared in 'subset'
it: un gruppo non definito è stato dichiarato in 'subset'

source: only one display level allowed
it: ammesso solo un livello di visualizzazione

source: undefined display level %s for %s
it: livello display %s non definito per %s

source: undefined collapsing level %s for %s
it: livello di compressione non definito %s per %s

source: collapsing level cannot be smaller than display level; setting it to the display level
it: il livello di compressione non può essere inferiore al livello di visualizzazione; viene impostato a quest'ultimo

source: 'preserve' must be a two-sided formula
it: 'preserve' dev'essere una formula su due lati

source: 'asTable' cannot be used with multilevel grouped data
it: 'asTable' può essere utilizzato solamente con dati raggruppati multilevel

source: 'asTable' can only be used with balanced 'groupedData' objects
it: 'asTable' può essere utilizzato solamente con oggetti bilanciati 'groupedData'

source: %d errors caught in %s. The error messages and their frequencies are
it: %d errori rilevati in %s. I messaggi di errore e le rispettive frequenze sono

source: 'data' argument not used, but taken from groupedData object
it: l'argomento 'data' non è utilizzato, ma preso da un oggetto groupedData

source: multiple levels not allowed
it: livelli multipli non ammessi

source: 'data' must be a "groupedData" object if 'groups' argument is missing
it: 'data' dev'essere un oggetto "groupedData" se l'argomento 'groups' è assente

source: 'data' in %s call must evaluate to a data frame
it: 'data' nella chiamata %s deve valutare un data frame

source: nonexistent groups requested in 'subset'
it: gruppi inesistenti richiesti in 'subset'

source: 'subset' can only be character or integer
it: 'subset' può solamente essere character o integer

source: log-likelihood not available with NULL fits
it: log-verosomiglianza non disponibile con adattamenti NULL

source: 'form' must be a formula
it: 'form' dev'essere una formula

source: 'form' must be a one-sided formula
it: 'form' dev'essere una formula su un lato

source: covariate must be a data frame
it: la covariata dev'essere una data frame

source: cannot do pairs of just one variable
it: non è possibile fare coppie di una sola variabile

source: 'id' must be between 0 and 1
it: 'id' dev'essere tra 0 e 1

source: 'id' can only be a formula or numeric
it: 'id' può essere solamente una formula o un numerico

source: 'idLabels' of incorrect length
it: 'idLabels' di lunghezza incorretta

source: 'idLabels' can only be a formula or a vector
it: 'idLabels' può solamente essere una formula o un vettore

source: covariate must be numeric
it: la covariata dev'essere numerica

source: nonexistent group in 'newdata'
it: gruppo non esistente in 'newdata'

source: nonexistent group requested in 'subset'
it: 'subset' ha richiesto un gruppo non esistente

source: only residuals and random effects allowed
it: sono ammessi solo i residui e gli effetti casuali

source: can only fit "lmList" objects with single grouping variable
it: si possono stimare solo oggetti "lmList" con una singola variabile di raggruppamento

source: 'lme.lmList' will redefine 'data'
it: 'lme.lmList' ri-definirà 'data'

source: initial value for "reStruct" overwritten in 'lme.lmList'
it: sovrascritto il valore iniziale "reStruct" in 'lme.lmList'

source: fixed-effects model must be a formula of the form "resp ~ pred"
it: il modello con effetti fissi dev'essere una formula nella forma "resp ~ pred"

source: incompatible lengths for 'random' and grouping factors
it: lunghezze incompatibili per fattori 'random' e di raggruppamento

source: incompatible formulas for groups in 'random' and 'correlation'
it: formule incompatibili per i gruppi in 'random' e 'correlation'

source: cannot use smaller level of grouping for 'correlation' than for 'random'. Replacing the former with the latter.
it: non è possibile utilizzare un livello di raggruppamento per 'correlation' inferiore a 'random'. Si sostituisce il primo con il secondo.

source: fewer observations than random effects in all level %s groups
it: numero di osservazioni inferiore agli effetti casuali in tutti i gruppi di livello %s

source: %s problem, convergence error code = %s message = %s
it: %s problema, codice errore di convergenza = %s messaggio = %s

source: maximum number of iterations (lmeControl(maxIter)) reached without convergence
it: raggiunto il numero massimo di iterazioni (lmeControl(maxIter)) senza convergenza

source: object must inherit from class "lme"
it: l'oggetto deve ereditare dalla classe "lme"

source: terms must all have the same denominator DF
it: i termini devono avere tutti il medesimo denominatore DF

source: L may only involve fixed effects with the same denominator DF
it: L potrebbe solamente indicare effetti fissi con il medesimo denominatore DF

source: objects must inherit from classes %s, or %s
it: gli oggetti devono ereditare dalle classi %s, o %s

source: some fitted objects deleted because response differs from the first model
it: eliminati alcuni oggetti adattati perché la risposta è diversa dal primo modello

source: first model has a different response from the rest
it: il primo modello ha una risposta differente dal resto

source: all fitted objects must have the same estimation method
it: tutti gli oggetti adattati devono avere il medesimo metodo di stima

source: fitted objects with different fixed effects. REML comparisons are not meaningful.
it: oggetti adattati con diversi effetti fissi. I confronti REML non sono significativi.

source: objects must have a "call" component or attribute
it: gli oggetti devono avere un componente o attributo "call"

source: all fitted objects must use the same number of observations
it: tutti gli oggetti devono utilizzare il medesimo numero di osservazioni

source: only single level allowed
it: ammesso solo un singolo livello

source: cannot get confidence intervals on var-cov components: %s Consider '%s'
it: non è possibile avere gli intervalli di confidenza su componenti var-cov: %s Si consideri '%s'

source: covariate must have a level attribute when groups are present
it: la covariata deve avere un attributo livello quando i gruppi sono presenti

source: covariate must have a level attribute when 'id' is a formula
it: la covariata deve avere un attributo di livello quando 'id' è una formula

source: covariate must have a level attribute when 'idLabels' is a formula
it: la covariata deve avere un attributo di livello quando 'idLabels' è una formula

source: 'form' must be a formula when not NULL
it: 'form' dev'essere una formula quando non NULL

source: only single effects allowed in left side of 'form'
it: sono ammessi solo singoli effetti nella parte sinistra di 'form'

source: %s is not a valid effect name
it: %s non è un valido nome effetto

source: no effects allowed in right side of formula
it: non sono ammessi effetti nel lato destro della formula

source: cannot evaluate groups for desired levels on 'newdata'
it: non è possibile valutare i gruppi per i livelli richiesti su 'newdata'

source: 'Id' must be between 0 and 1
it: 'Id' dev'essere tra 0 e 1

source: augmentation of random effects only available for single level
it: aumento degli effetti casuali disponibile solo per livello singolo

source: no condensed linear model
it: nessun modello lineare condensato

source: no fitted "lme" object
it: nessun oggetto adattato "lme"

source: objects must have coefficients with same row names
it: gli oggetti devono avere coefficienti con gli stessi nomi di riga

source: object must inherit from "data.frame"
it: l'oggetto deve ereditare dalla classe "data.frame"

source: only one level allowed in 'gapply'
it: ammesso solo un livello in "gapply"

source: 'which' must be between 1 and %d
it: 'which' dev'essere tra 1 e %d

source: 'which' can only be character or integer
it: 'which' può essere solamente character o integer

source: formula(object) must return a formula
it: formula(object) deve restituire una formula

source: 'form' must be a two-sided formula
it: 'form' dev'essere una formula su due lati

source: only one level allowed in 'gsummary'
it: ammesso solo un livello in "gsummary"

source: 'FUN' can only be a function or a list of functions
it: 'FUN' può essere solo una funzione o una lista di funzioni

source: cannot omit grouping factor without 'form'
it: non è possibile omettere il fattore di raggruppamento senza 'form'

source: object must inherit from class "lmList"
it: l'oggetto deve ereditare dalla classe "lmList"

source: no degrees of freedom for estimating std. dev.
it: non ci sono gradi di libertà per la stima della deviazione standard.

source: invalid formula for groups
it: formula non valida per i gruppi

source: 'form' must have all components as formulas
it: 'form' deve avere tutti i componenti come formule

source: 'form' can only be a formula, or a list of formulas
it: 'form' può essere solamente una formula o una lista di formule

source: level of %s does not match formula %s
it: il livello di %s non corrisponde con la formula %s

source: 'form' argument must be a formula
it: l'argomento 'form' dev'essere una formula

source: at least two coefficients are needed
it: almeno due coefficienti sono richiesti

source: no model variogram available with 'showModel = TRUE'
it: nessun variogramma di modello disponibile con 'showModel = TRUE'

source: only residuals allowed
it: sono ammessi solo i residui

source: 'distance' and 'object' have incompatible lengths
it: 'distance' e 'object' hanno lunghezze incompatibili

source: 'nlme.nlsList' will redefine 'fixed', 'data', and 'start'
it: 'nlme.nlsList' ri-definirà 'fixed', 'data' e 'start'

source: initial value for 'reStruct' overwritten in 'nlme.nlsList'
it: sovrascritto il valore iniziale "reStruct" in 'nlme.nlsList'

source: 'model' must be a formula
it: 'model' dev'essere una formula

source: model formula must be of the form "resp ~ pred"
it: la formula del modello dev'essere nella forma "resp ~ pred"

source: 'data' must be given explicitly to use 'nlsList'
it: 'data' dev'essere indicato esplicitamente per l'utilizzo di 'nlsList'

source: 'fixed' must be a formula or list of formulae
it: 'fixed' dev'essere una formula o una lista di formule

source: formulae in 'fixed' must be of the form "parameter ~ expr"
it: le formule in 'fixed' devono essere nella forma "parametro ~ espressione"

source: 'random' must be a formula or list of formulae
it: 'random' dev'essere una formula o una lista di formule

source: formulae in 'random' must be of the form "parameter ~ expr"
it: le formule in 'random' devono essere nella forma "parametro ~ espressione"

source: incompatible formulas for groups in "random" and "correlation"
it: formule incompatibili per i gruppi in "random" e "correlation"

source: cannot use smaller level of grouping for "correlation" than for "random". Replacing the former with the latter.
it: non è possibile utilizzare un livello di raggruppamento per "correlation" inferiore a "random". Si sostituisce il primo con il secondo.

source: 'start' must have a component called 'fixed'
it: 'start' deve avere una componente chiamata 'fixed'

source: starting values for the 'fixed' component are not the correct length
it: i valori iniziali per la componente 'fixed' non sono della lunghezza corretta

source: starting values for random effects should be a list, or a matrix
it: i valori iniziali per gli effetti casuali dovrebbero essere una lista o una matrice

source: starting values for the random components should be a list of matrices
it: i valori iniziali per le componenti casuali dovrebbero essere una lista di matrici

source: number of rows in starting values for random component at level %s should be %d
it: il numero di righe nei valori iniziali per la componente casuale al livello %s dovrebbe essere %d

source: number of columns in starting values for random component at level %s should be %d
it: il numero di colonne nei valori iniziali per la componente casuale al livello %s dovrebbe essere %d

source: starting values for random effects must include group levels
it: i valori iniziali per gli effetti casuali devono includere i livelli di gruppo

source: groups levels mismatch in 'random' and starting values for 'random' at level %s
it: i livelli dei gruppi non corrispondono in 'random' e nei valori iniziali per 'random' al livello %s

source: names mismatch in 'random' and starting values for 'random' at level %s
it: i nomi non corrispondono in 'random' e nei valori iniziali per 'random' al livello %s
