Repository: dmedri/R-italian-lang
Catalog: packages/nlme/po/R-*.po
Languages: it

source: Iteration %d, LME step: nlminb() did not converge (code = %d).
it: Iterazione %d, passo LME: nlminb() non converge (codice = %d).

source: Do increase 'msMaxIter'!
it: Incrementa 'msMaxIter'!

source: PORT message:
it: PORT messaggio:

source: Iteration %d, LME step: nlm() did not converge (code = %d).
it: Iterazione %d, passo LME: nlm() non converge (codice = %d).

source: maximum number of iterations (maxIter = %d) reached without convergence
it: raggiunto il numero massimo di iterazioni (maxIter = %d) senza convergenza

source: second argument must be a groupedData object
it: il secondo argomento dev'essere un oggetto groupedData

source: cannot use an anonymous function for the model
it: non è possibile utilizzare una funzione anonima per il modello

source: 'data' must be a "groupedData" object if 'formula' does not include groups
it: 'data' dev'essere un oggetto "groupedData" se 'formula' non include i gruppi

source: missing call attribute in "nlsList" object
it: attributo chiamata assente nell'oggetto "nlsList"

source: cannot access the matrix of uninitialized objects
it: non è possibile accedere alla matrice di oggetti non inizializzati

source: ignoring argument 'form'
it: si ignora l'argomento 'form'

source: ignoring argument 'nam'
it: si ignora l'argomento 'nam'

source: 'value' must be a square matrix
it: 'value' dev'essere una matrice quadrata

source: dimnames of 'value' must match or be NULL
it: i nomi delle dimensioni di 'value' devono corrispondere o essere NULL

source: names of 'value' are not consistent with 'nam' argument
it: i nomi di 'value' non sono coerenti con l'argomento 'nam'

source: %s is not a valid object for "pdMat"
it: %s non è un valido oggetto per "pdMat"

source: all elements of 'form' list must be two-sided formulas
it: tutti gli elementi della lista 'form' devono essere formule su due lati

source: 'form' can only be a formula or a list of formulae
it: 'form' può essere solamente una formula o una lista di formule

source: 'form' not consistent with 'nam'
it: 'form' non coerente con 'nam'

source: length of 'nam' not consistent with dimensions of initial value
it: la lunghezza di 'nam' non è coerente con le dimensioni del valore iniziale

source: no default method for extracting the square root of a "pdMat" object
it: nessun metodo predefinito per estrarre la radice quadrata di un oggetto "pdMat"

source: do not know how to obtain constrained coefficients
it: non è possibile ottenere coefficienti vincolati

source: cannot access the number of columns of uninitialized objects without names
it: non è possibile accedere al numero di colonne degli oggetti inizializzati senza nomi

source: cannot extract the log of the determinant from an uninitialized object
it: non è possibile estrarre il logaritmo di un determinante da un oggetto non inizializzato

source: cannot change dimensions on an initialized "pdMat" object
it: non si possono cambiare le dimensioni su un oggetto "pdMat" inizializzato

source: Length of names should be %d
it: La lunghezza dei nomi dovrebbe essere %d

source: names being assigned do not correspond to a permutation of previous names
it: i nomi assegnati non corrispondono a una permutazione dei nomi precedenti

source: cannot get the inverse of an uninitialized object
it: non è possibile estrarre l'inversa di un oggetto non inizializzato

source: an object of length %d does not match the required parameter size
it: un oggetto di lunghezza %d non corrisponde alla dimensione richiesta per il parametro

source: cannot extract matrix from an uninitialized object
it: non è possibile estrarre la matrice da un oggetto non inizializzato

source: cannot extract the inverse from an uninitialized object
it: non è possibile estrarre l'inversa di un oggetto non inizializzato

source: an object of length %d does not match a Cholesky factor
it: un oggetto di lunghezza %d non corrisponde ad un fattore Cholesky

source: cannot extract the matrix from an uninitialized object
it: non è possibile estrarre la matrice da un oggetto non inizializzato

source: cannot extract the matrix from an uninitialized "pdIdent" object
it: non è possibile estrarre la matrice da un oggetto "pdIdent" non inizializzato

source: cannot extract the matrix with uninitialized dimensions
it: non è possibile estrarre la matrice con dimensioni non inizializzate

source: must give names when initializing "pdIdent" from parameter without a formula
it: bisogna indicare i nomi quando si inizializza "pdIdent" dal parametro senza una formula

source: cannot extract the dimensions
it: non è possibile estrarre le dimensioni

source: cannot extract the matrix from an uninitialized "pdCompSymm" object
it: non è possibile estrarre la matrice da un oggetto "pdCompSymm" non inizializzato

source: must give names when initializing "pdCompSymm" from parameter without a formula
it: bisogna indicare i nomi quando si inizializza "pdCompSymm" dal parametro senza una formula

source: cannot obtain constrained coefficients with uninitialized dimensions
it: non è possibile ottenere coefficienti vincolati con dimensioni non inizializzate

source: cannot access the matrix of object without names
it: non si può accedere alla matrice dell'oggetto senza nomi

source: 'form' must be a list
it: 'form' dev'essere una lista

source: 'nam' must be a list
it: 'nam' dev'essere una lista

source: 'form' and 'nam' have incompatible lengths
it: 'form' e 'nam' hanno lunghezze incompatibili

source: 'pdClass' must be a character vector
it: 'pdClass' dev'essere un vettore di caratteri

source: 'form' and 'pdClass' have incompatible lengths
it: 'form' e 'pdClass' hanno lunghezze incompatibili

source: 'nam' and 'pdClass' have incompatible lengths
it: 'nam' e 'pdClass' hanno lunghezza incompatibili

source: 'object' must be a list when not missing, not a matrix, and not numeric
it: 'object' dev'essere una lista nominata, non una matrice e non numerica

source: arguments imply different number of blocks
it: gli argomenti implicano un numero differente di blocchi

source: all elements in the argument must generate "pdMat" objects
it: tutti gli elementi nell'argomento devono generare oggetti "pdMat"

source: cannot have duplicated column names in a "pdMat" object
it: non è possibile avere una colonna nomi duplicata in un oggetto "pdMat"

source: must have formula when no names are given
it: bisogna avere una formula quando non vengono indicati nomi

source: must give names when initializing from matrix or parameter
it: bisogna indicare dei nomi quando si inizializza da una matrice o da un parametro

source: all elements must have names when any has names
it: tutti gli elementi devono avere nomi quando uno ha nomi

source: all elements must have a non-zero size
it: tutti gli elementi devono avere un lato non-zero

source: cannot change the parameter when length of parameters is undefined
it: non è possibile cambiare il parametro quando la lunghezza dei parametri è indefinita

source: cannot change parameter length of initialized "pdMat" object
it: non si può cambiare il parametro lunghezza di un oggetto "pdMat" inizializzato

source: all elements must have formulas when any has a formula
it: tutti gli elementi devono avere formule quando ne esiste una

source: all elements of formula must be list of two-sided formulae or two-sided formulae
it: tutti gli elementi della formula devono essere liste di formule a due lati o formule a due lati

source: cannot change the number of columns on an initialized object
it: non si può cambiare il numero di colonne di un oggetto inizializzato

source: names of object and value must match
it: i nomi dell'oggetto e del valore devono corrispondere

source: "pdMat" element must have a formula
it: l'elemento "pdMat" deve avere una formula

source: 'object' must be a list or a formula
it: 'object' dev'essere una lista o una formula

source: "pdMat" elements must have a formula
it: gli elementi "pdMat" devono avere una formula

source: elements in 'object' must be formulas or "pdMat" objects
it: gli elementi in 'object' devono essere formule o oggetti "pdMat"

source: cannot change the parameter when ength of parameters is undefined
it: non si può cambiare il parametro quando la lunghezza dei parametri non è definita

source: cannot change parameter length of initialized objects
it: non si può cambiare il parametro lunghezza degli oggetti inizializzati

source: cannot extract groups formula without a formula
it: non è possibile estrarre i gruppi senza una formula

source: all elements of a "reStruct" object must have a non-zero size
it: tutti gli elementi di un oggetto "reStruct" deve avere un lato non-zero

source: cannot change the length of 'object'
it: non si può cambiare la lunghezza di 'object'

source: cannot extract model matrix without formula
it: non si può estrarre la matrice del modello senza una formula

source: incompatible lengths for object names
it: lunghezze non compatibili per i nomi degli oggetti

source: 'data' must inherit from "groupedData" class if 'random' does not define groups
it: 'data' deve ereditare dalla classe "groupedData" se 'random' non definisce i gruppi

source: models with "corStruct" and/or "varFunc" objects not allowed
it: non sono ammessi modelli con "corStruct" e/o "varFunc"

source: no degrees of freedom specified
it: gradi di libertà non specificati

source: plot method only implemented for comparing models
it: metodo di plot implementato unicamente per la comparazione di modelli

source: degrees of freedom and weights must have the same length
it: i gradi di libertà e i pesi devono avere la medesima lunghezza

source: negative degrees of freedom not allowed
it: gradi di libertà negativi non ammessi

source: more than one degree of freedom is needed when one them is zero.
it: è necessario più di un grado di libertà quando uno di essi è zero.

source: cannot extract parameters of uninitialized object
it: non è possibile estrarre i parametri da un oggetto non inizializzato

source: do not know how to get coefficients for %s object
it: non si possono ottenere i coefficienti per l'oggetto %s

source: cannot change the length of covariate in "varFunc" object
it: non è possibile cambiare la lunghezza della covariata nell'oggetto "varFunc"

source: 'value' must be a one sided formula
it: 'value' dev'essere una formula su un lato

source: 'form' must have a covariate
it: 'form' deve avere una covariata

source: ignoring 'group' in "varFixed" formula
it: sarà ignorato 'group' nella formula "varFixed"

source: all variables used in 'formula' must be in 'data'
it: tutte le variabili utilizzate nella 'formula' devono essere in 'data'

source: initial values must have group names in 'varIdent'
it: i valori iniziali devono avere i nomi dei gruppi in 'varIdent'

source: initial values for 'varIdent' must be > 0
it: i valori iniziali per 'varIdent' devono essere > 0

source: fixed parameters must have names in 'varIdent'
it: i parametri fissi devono avere i nomi in 'varIdent'

source: cannot change the length of the "varIdent" parameter after initialization
it: non è possibile cambiare la lunghezza del parametro "varIdent" dopo l'inizializzazione

source: initial value for "varIdent" should be of length %d
it: il valore iniziale per "varIdent" dovrebbe essere di lunghezza %d

source: nonexistent group names for initial values in 'varIdent'
it: nomi dei gruppi inesistenti per i valori iniziali in "varIdent"

source: initial values must have group names in 'varPower'
it: i valori iniziali devono avere i nomi dei gruppi in 'varPower'

source: fixed parameters must have group names in 'varPower'
it: i parametri fissati devono avere nomi di gruppo in 'varPower'

source: cannot change the length of the "varStruct" parameter after initialization
it: non è possibile cambiare la lunghezza del parametro "varStruct" dopo l'inizializzazione

source: fixed parameters must have group names
it: i parametri fissati devono avere nomi di gruppo

source: mismatch between group names and fixed values names
it: mancata corrispondenza tra i nomi dei gruppi e i nomi dei valori fissati

source: initial value for "varPower" should be of length %d
it: il valore iniziale per "varPower" dovrebbe essere di lunghezza %d

source: nonexistent group names for initial values in "varPower"
it: nomi dei gruppi inesistenti per i valori iniziali in "varPower"

source: initial value for "varPower" should be of length 1
it: il valore iniziale per "varPower" dovrebbe essere di lunghezza 1

source: initial values must have group names in 'varExp'
it: i valori iniziali devono avere i nomi dei gruppi in 'varExp'

source: fixed parameters must have group names in 'varExp'
it: i parametri fissati devono avere nomi di gruppo in 'varExp'

source: cannot change the length of the "varExp" parameter after initialization
it: non è possibile cambiare la lunghezza del parametro "varExp" dopo l'inizializzazione

source: initial value for "varExp" should be of length %d
it: il valore iniziale per "varExp" dovrebbe essere di lunghezza %d

source: nonexistent group names for initial values in "varExp"
it: nomi dei gruppi inesistenti per i valori iniziali in "varExp"

source: initial value for "varExp" should be of length 1
it: il valore iniziale per "varExp" dovrebbe essere di lunghezza 1

source: %s can have at most two components
it: %s può avere al massimo due componenti

source: %s can only have names "const" and "power"
it: %s può avere solo nomi "const" e "power"

source: %s can only be a list or numeric
it: %s può essere solamente una lista o un valore numerico

source: %s must have group names in 'varConstPower'
it: %s deve avere nomi di gruppo in 'varConstPower'

source: constant in "varConstProp" structure must be > 0
it: la costante nella struttura "varConstProp" dev'essere > 0

source: initial value should be of length %d
it: il valore iniziale dovrebbe essere di lunghezza %d

source: nonexistent group names for initial values
it: nomi dei gruppi inesistenti per i valori iniziali

source: %s can only have names "const" and "prop"
it: %s può avere solo nomi "const" e "prop"

source: %s must have group names in 'varConstProp'
it: %s deve avere nomi di gruppo in 'varConstProp'

source: all arguments to 'varComb' must be of class "varFunc".
it: tutti gli argomenti di 'varComb' devono essere della classe "varFunc".

source: cannot change parameter length of initialized "varComb" object
it: non è possibile cambiare il parametro lunghezza di un oggetto "varComb" inizializzato

source: Package
it: Pacchetto

source: installed with old R version
it: installato con una vecchia versione di R

source: should not be used with R version
it: non dovrebbe essere utilizzato con la versione di R

source: Rather re-install it with this version of R.
it: Piuttosto re-installalo con questa versione di R.

source: deviance undefined for REML fit
it: devianza non definita per l'adattamento REML

source: AIC undefined for REML fit
it: AIC non definito per adattamento REML

source: not (yet) implemented. Contributions are welcome; use intervals() instead (for now)
it: non (ancora) implementato. I contributi sono graditi; si usi in alternativa intervals() (per ora)

source: term %s not matched
it: termine %s non corrispondente

source: 'L' must have at most %d column
it: 'L' deve avere al massimo %d colonna

source: effect %s not matched
it: l'effetto %s non corrisponde

source: level %s not allowed for %s
it: livello %s non ammesso per %s

source: %d error caught in %s: %s
it: %d errore rilevato in %s: %s

source: %s not found in data
it: %s non trovato nei dati

source: nonexistent level %s
it: livello %s non esistente

source: %s not available for plotting
it: %s non disponibile per il plotting

source: %s not matched
it: %s non corrisponde
